zzfjean/micropython_esp32/ports/esp32/boards/GENERIC_SPIRAM/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "ESP32 module (spiram)"
#define MICROPY_HW_MCU_NAME "ESP32"

#define MICROPY_PY_MACHINE_DAC              (0)
#define MICROPY_HW_ENABLE_CAN               (1)


// Enable UART REPL for modules that have an external USB-UART and don't use native USB.
#define MICROPY_HW_ENABLE_UART_REPL         (1)

#define MICROPY_HW_I2C0_SCL                 (9)
#define MICROPY_HW_I2C0_SDA                 (8)

